Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/tdes.h
/**
 * \brief Component description for TDES
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_TDES_COMPONENT_H_
#define _SAM9X_TDES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TDES                                         */
/* ************************************************************************** */

/* -------- TDES_CR : (TDES Offset: 0x00) ( /W 32) Control Register -------- */
#define TDES_CR_START_Pos                     _U_(0)                                               /**< (TDES_CR) Start Processing Position */
#define TDES_CR_START_Msk                     (_U_(0x1) << TDES_CR_START_Pos)                      /**< (TDES_CR) Start Processing Mask */
#define TDES_CR_START(value)                  (TDES_CR_START_Msk & ((value) << TDES_CR_START_Pos))
#define TDES_CR_SWRST_Pos                     _U_(8)                                               /**< (TDES_CR) Software Reset Position */
#define TDES_CR_SWRST_Msk                     (_U_(0x1) << TDES_CR_SWRST_Pos)                      /**< (TDES_CR) Software Reset Mask */
#define TDES_CR_SWRST(value)                  (TDES_CR_SWRST_Msk & ((value) << TDES_CR_SWRST_Pos))
#define TDES_CR_LOADSEED_Pos                  _U_(16)                                              /**< (TDES_CR) Loadseed Position */
#define TDES_CR_LOADSEED_Msk                  (_U_(0x1) << TDES_CR_LOADSEED_Pos)                   /**< (TDES_CR) Loadseed Mask */
#define TDES_CR_LOADSEED(value)               (TDES_CR_LOADSEED_Msk & ((value) << TDES_CR_LOADSEED_Pos))
#define TDES_CR_UNLOCK_Pos                    _U_(24)                                              /**< (TDES_CR) Unlock Processing Position */
#define TDES_CR_UNLOCK_Msk                    (_U_(0x1) << TDES_CR_UNLOCK_Pos)                     /**< (TDES_CR) Unlock Processing Mask */
#define TDES_CR_UNLOCK(value)                 (TDES_CR_UNLOCK_Msk & ((value) << TDES_CR_UNLOCK_Pos))
#define TDES_CR_Msk                           _U_(0x01010101)                                      /**< (TDES_CR) Register Mask  */


/* -------- TDES_MR : (TDES Offset: 0x04) (R/W 32) Mode Register -------- */
#define TDES_MR_CIPHER_Pos                    _U_(0)                                               /**< (TDES_MR) Processing Mode Position */
#define TDES_MR_CIPHER_Msk                    (_U_(0x1) << TDES_MR_CIPHER_Pos)                     /**< (TDES_MR) Processing Mode Mask */
#define TDES_MR_CIPHER(value)                 (TDES_MR_CIPHER_Msk & ((value) << TDES_MR_CIPHER_Pos))
#define   TDES_MR_CIPHER_DECRYPT_Val          _U_(0x0)                                             /**< (TDES_MR) Decrypts data.  */
#define   TDES_MR_CIPHER_ENCRYPT_Val          _U_(0x1)                                             /**< (TDES_MR) Encrypts data.  */
#define TDES_MR_CIPHER_DECRYPT                (TDES_MR_CIPHER_DECRYPT_Val << TDES_MR_CIPHER_Pos)   /**< (TDES_MR) Decrypts data. Position  */
#define TDES_MR_CIPHER_ENCRYPT                (TDES_MR_CIPHER_ENCRYPT_Val << TDES_MR_CIPHER_Pos)   /**< (TDES_MR) Encrypts data. Position  */
#define TDES_MR_TDESMOD_Pos                   _U_(1)                                               /**< (TDES_MR) ALGORITHM Mode Position */
#define TDES_MR_TDESMOD_Msk                   (_U_(0x3) << TDES_MR_TDESMOD_Pos)                    /**< (TDES_MR) ALGORITHM Mode Mask */
#define TDES_MR_TDESMOD(value)                (TDES_MR_TDESMOD_Msk & ((value) << TDES_MR_TDESMOD_Pos))
#define   TDES_MR_TDESMOD_SINGLE_DES_Val      _U_(0x0)                                             /**< (TDES_MR) Single DES processing using Key 1 Registers  */
#define   TDES_MR_TDESMOD_TRIPLE_DES_Val      _U_(0x1)                                             /**< (TDES_MR) Triple DES processing using Key 1, Key 2 and Key 3 Registers  */
#define   TDES_MR_TDESMOD_XTEA_Val            _U_(0x2)                                             /**< (TDES_MR) XTEA processing using Key 1 and Key 2 Registers  */
#define TDES_MR_TDESMOD_SINGLE_DES            (TDES_MR_TDESMOD_SINGLE_DES_Val << TDES_MR_TDESMOD_Pos) /**< (TDES_MR) Single DES processing using Key 1 Registers Position  */
#define TDES_MR_TDESMOD_TRIPLE_DES            (TDES_MR_TDESMOD_TRIPLE_DES_Val << TDES_MR_TDESMOD_Pos) /**< (TDES_MR) Triple DES processing using Key 1, Key 2 and Key 3 Registers Position  */
#define TDES_MR_TDESMOD_XTEA                  (TDES_MR_TDESMOD_XTEA_Val << TDES_MR_TDESMOD_Pos)    /**< (TDES_MR) XTEA processing using Key 1 and Key 2 Registers Position  */
#define TDES_MR_KEYMOD_Pos                    _U_(4)                                               /**< (TDES_MR) Key Mode Position */
#define TDES_MR_KEYMOD_Msk                    (_U_(0x1) << TDES_MR_KEYMOD_Pos)                     /**< (TDES_MR) Key Mode Mask */
#define TDES_MR_KEYMOD(value)                 (TDES_MR_KEYMOD_Msk & ((value) << TDES_MR_KEYMOD_Pos))
#define TDES_MR_PKWO_Pos                      _U_(6)                                               /**< (TDES_MR) Private Key Write Once Position */
#define TDES_MR_PKWO_Msk                      (_U_(0x1) << TDES_MR_PKWO_Pos)                       /**< (TDES_MR) Private Key Write Once Mask */
#define TDES_MR_PKWO(value)                   (TDES_MR_PKWO_Msk & ((value) << TDES_MR_PKWO_Pos))  
#define TDES_MR_PKRS_Pos                      _U_(7)                                               /**< (TDES_MR) Private Key Internal Register Select Position */
#define TDES_MR_PKRS_Msk                      (_U_(0x1) << TDES_MR_PKRS_Pos)                       /**< (TDES_MR) Private Key Internal Register Select Mask */
#define TDES_MR_PKRS(value)                   (TDES_MR_PKRS_Msk & ((value) << TDES_MR_PKRS_Pos))  
#define TDES_MR_SMOD_Pos                      _U_(8)                                               /**< (TDES_MR) Start Mode Position */
#define TDES_MR_SMOD_Msk                      (_U_(0x3) << TDES_MR_SMOD_Pos)                       /**< (TDES_MR) Start Mode Mask */
#define TDES_MR_SMOD(value)                   (TDES_MR_SMOD_Msk & ((value) << TDES_MR_SMOD_Pos))  
#define   TDES_MR_SMOD_MANUAL_START_Val       _U_(0x0)                                             /**< (TDES_MR) Manual Mode  */
#define   TDES_MR_SMOD_AUTO_START_Val         _U_(0x1)                                             /**< (TDES_MR) Auto Mode  */
#define   TDES_MR_SMOD_IDATAR0_START_Val      _U_(0x2)                                             /**< (TDES_MR) TDES_IDATAR0 accesses only Auto Mode  */
#define TDES_MR_SMOD_MANUAL_START             (TDES_MR_SMOD_MANUAL_START_Val << TDES_MR_SMOD_Pos)  /**< (TDES_MR) Manual Mode Position  */
#define TDES_MR_SMOD_AUTO_START               (TDES_MR_SMOD_AUTO_START_Val << TDES_MR_SMOD_Pos)    /**< (TDES_MR) Auto Mode Position  */
#define TDES_MR_SMOD_IDATAR0_START            (TDES_MR_SMOD_IDATAR0_START_Val << TDES_MR_SMOD_Pos) /**< (TDES_MR) TDES_IDATAR0 accesses only Auto Mode Position  */
#define TDES_MR_OPMOD_Pos                     _U_(12)                                              /**< (TDES_MR) Operating Mode Position */
#define TDES_MR_OPMOD_Msk                     (_U_(0x3) << TDES_MR_OPMOD_Pos)                      /**< (TDES_MR) Operating Mode Mask */
#define TDES_MR_OPMOD(value)                  (TDES_MR_OPMOD_Msk & ((value) << TDES_MR_OPMOD_Pos))
#define   TDES_MR_OPMOD_ECB_Val               _U_(0x0)                                             /**< (TDES_MR) Electronic Code Book mode  */
#define   TDES_MR_OPMOD_CBC_Val               _U_(0x1)                                             /**< (TDES_MR) Cipher Block Chaining mode  */
#define   TDES_MR_OPMOD_OFB_Val               _U_(0x2)                                             /**< (TDES_MR) Output Feedback mode  */
#define   TDES_MR_OPMOD_CFB_Val               _U_(0x3)                                             /**< (TDES_MR) Cipher Feedback mode  */
#define TDES_MR_OPMOD_ECB                     (TDES_MR_OPMOD_ECB_Val << TDES_MR_OPMOD_Pos)         /**< (TDES_MR) Electronic Code Book mode Position  */
#define TDES_MR_OPMOD_CBC                     (TDES_MR_OPMOD_CBC_Val << TDES_MR_OPMOD_Pos)         /**< (TDES_MR) Cipher Block Chaining mode Position  */
#define TDES_MR_OPMOD_OFB                     (TDES_MR_OPMOD_OFB_Val << TDES_MR_OPMOD_Pos)         /**< (TDES_MR) Output Feedback mode Position  */
#define TDES_MR_OPMOD_CFB                     (TDES_MR_OPMOD_CFB_Val << TDES_MR_OPMOD_Pos)         /**< (TDES_MR) Cipher Feedback mode Position  */
#define TDES_MR_LOD_Pos                       _U_(15)                                              /**< (TDES_MR) Last Output Data Mode Position */
#define TDES_MR_LOD_Msk                       (_U_(0x1) << TDES_MR_LOD_Pos)                        /**< (TDES_MR) Last Output Data Mode Mask */
#define TDES_MR_LOD(value)                    (TDES_MR_LOD_Msk & ((value) << TDES_MR_LOD_Pos))    
#define TDES_MR_CFBS_Pos                      _U_(16)                                              /**< (TDES_MR) Cipher Feedback Data Size Position */
#define TDES_MR_CFBS_Msk                      (_U_(0x3) << TDES_MR_CFBS_Pos)                       /**< (TDES_MR) Cipher Feedback Data Size Mask */
#define TDES_MR_CFBS(value)                   (TDES_MR_CFBS_Msk & ((value) << TDES_MR_CFBS_Pos))  
#define   TDES_MR_CFBS_SIZE_64BIT_Val         _U_(0x0)                                             /**< (TDES_MR) 64-bit  */
#define   TDES_MR_CFBS_SIZE_32BIT_Val         _U_(0x1)                                             /**< (TDES_MR) 32-bit  */
#define   TDES_MR_CFBS_SIZE_16BIT_Val         _U_(0x2)                                             /**< (TDES_MR) 16-bit  */
#define   TDES_MR_CFBS_SIZE_8BIT_Val          _U_(0x3)                                             /**< (TDES_MR) 8-bit  */
#define TDES_MR_CFBS_SIZE_64BIT               (TDES_MR_CFBS_SIZE_64BIT_Val << TDES_MR_CFBS_Pos)    /**< (TDES_MR) 64-bit Position  */
#define TDES_MR_CFBS_SIZE_32BIT               (TDES_MR_CFBS_SIZE_32BIT_Val << TDES_MR_CFBS_Pos)    /**< (TDES_MR) 32-bit Position  */
#define TDES_MR_CFBS_SIZE_16BIT               (TDES_MR_CFBS_SIZE_16BIT_Val << TDES_MR_CFBS_Pos)    /**< (TDES_MR) 16-bit Position  */
#define TDES_MR_CFBS_SIZE_8BIT                (TDES_MR_CFBS_SIZE_8BIT_Val << TDES_MR_CFBS_Pos)     /**< (TDES_MR) 8-bit Position  */
#define TDES_MR_CKEY_Pos                      _U_(20)                                              /**< (TDES_MR) Countermeasure Key Position */
#define TDES_MR_CKEY_Msk                      (_U_(0xF) << TDES_MR_CKEY_Pos)                       /**< (TDES_MR) Countermeasure Key Mask */
#define TDES_MR_CKEY(value)                   (TDES_MR_CKEY_Msk & ((value) << TDES_MR_CKEY_Pos))  
#define TDES_MR_CMTYP1_Pos                    _U_(24)                                              /**< (TDES_MR) Countermeasure Type 1 Position */
#define TDES_MR_CMTYP1_Msk                    (_U_(0x1) << TDES_MR_CMTYP1_Pos)                     /**< (TDES_MR) Countermeasure Type 1 Mask */
#define TDES_MR_CMTYP1(value)                 (TDES_MR_CMTYP1_Msk & ((value) << TDES_MR_CMTYP1_Pos))
#define   TDES_MR_CMTYP1_NO_PAUSE_Val         _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 1 is disabled.  */
#define   TDES_MR_CMTYP1_PAUSE_Val            _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 1 is enabled.  */
#define TDES_MR_CMTYP1_NO_PAUSE               (TDES_MR_CMTYP1_NO_PAUSE_Val << TDES_MR_CMTYP1_Pos)  /**< (TDES_MR) Countermeasure type 1 is disabled. Position  */
#define TDES_MR_CMTYP1_PAUSE                  (TDES_MR_CMTYP1_PAUSE_Val << TDES_MR_CMTYP1_Pos)     /**< (TDES_MR) Countermeasure type 1 is enabled. Position  */
#define TDES_MR_CMTYP2_Pos                    _U_(25)                                              /**< (TDES_MR) Countermeasure Type 2 Position */
#define TDES_MR_CMTYP2_Msk                    (_U_(0x1) << TDES_MR_CMTYP2_Pos)                     /**< (TDES_MR) Countermeasure Type 2 Mask */
#define TDES_MR_CMTYP2(value)                 (TDES_MR_CMTYP2_Msk & ((value) << TDES_MR_CMTYP2_Pos))
#define   TDES_MR_CMTYP2_NO_DUMMY_Val         _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 2 is disabled.  */
#define   TDES_MR_CMTYP2_DUMMY_Val            _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 2 is enabled.  */
#define TDES_MR_CMTYP2_NO_DUMMY               (TDES_MR_CMTYP2_NO_DUMMY_Val << TDES_MR_CMTYP2_Pos)  /**< (TDES_MR) Countermeasure type 2 is disabled. Position  */
#define TDES_MR_CMTYP2_DUMMY                  (TDES_MR_CMTYP2_DUMMY_Val << TDES_MR_CMTYP2_Pos)     /**< (TDES_MR) Countermeasure type 2 is enabled. Position  */
#define TDES_MR_CMTYP3_Pos                    _U_(26)                                              /**< (TDES_MR) Countermeasure Type 3 Position */
#define TDES_MR_CMTYP3_Msk                    (_U_(0x1) << TDES_MR_CMTYP3_Pos)                     /**< (TDES_MR) Countermeasure Type 3 Mask */
#define TDES_MR_CMTYP3(value)                 (TDES_MR_CMTYP3_Msk & ((value) << TDES_MR_CMTYP3_Pos))
#define   TDES_MR_CMTYP3_NO_RESTART_Val       _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 3 is disabled.  */
#define   TDES_MR_CMTYP3_RESTART_Val          _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 3 is enabled.  */
#define TDES_MR_CMTYP3_NO_RESTART             (TDES_MR_CMTYP3_NO_RESTART_Val << TDES_MR_CMTYP3_Pos) /**< (TDES_MR) Countermeasure type 3 is disabled. Position  */
#define TDES_MR_CMTYP3_RESTART                (TDES_MR_CMTYP3_RESTART_Val << TDES_MR_CMTYP3_Pos)   /**< (TDES_MR) Countermeasure type 3 is enabled. Position  */
#define TDES_MR_CMTYP4_Pos                    _U_(27)                                              /**< (TDES_MR) Countermeasure Type 4 Position */
#define TDES_MR_CMTYP4_Msk                    (_U_(0x1) << TDES_MR_CMTYP4_Pos)                     /**< (TDES_MR) Countermeasure Type 4 Mask */
#define TDES_MR_CMTYP4(value)                 (TDES_MR_CMTYP4_Msk & ((value) << TDES_MR_CMTYP4_Pos))
#define   TDES_MR_CMTYP4_NO_IDLECURRENT_Val   _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 4 is disabled.  */
#define   TDES_MR_CMTYP4_IDLECURRENT_Val      _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 4 is enabled.  */
#define TDES_MR_CMTYP4_NO_IDLECURRENT         (TDES_MR_CMTYP4_NO_IDLECURRENT_Val << TDES_MR_CMTYP4_Pos) /**< (TDES_MR) Countermeasure type 4 is disabled. Position  */
#define TDES_MR_CMTYP4_IDLECURRENT            (TDES_MR_CMTYP4_IDLECURRENT_Val << TDES_MR_CMTYP4_Pos) /**< (TDES_MR) Countermeasure type 4 is enabled. Position  */
#define TDES_MR_CMTYP5_Pos                    _U_(28)                                              /**< (TDES_MR) Countermeasure Type 5 Position */
#define TDES_MR_CMTYP5_Msk                    (_U_(0x1) << TDES_MR_CMTYP5_Pos)                     /**< (TDES_MR) Countermeasure Type 5 Mask */
#define TDES_MR_CMTYP5(value)                 (TDES_MR_CMTYP5_Msk & ((value) << TDES_MR_CMTYP5_Pos))
#define   TDES_MR_CMTYP5_NO_ADDACCESS_Val     _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 5 is disabled.  */
#define   TDES_MR_CMTYP5_ADDACCESS_Val        _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 5 is enabled.  */
#define TDES_MR_CMTYP5_NO_ADDACCESS           (TDES_MR_CMTYP5_NO_ADDACCESS_Val << TDES_MR_CMTYP5_Pos) /**< (TDES_MR) Countermeasure type 5 is disabled. Position  */
#define TDES_MR_CMTYP5_ADDACCESS              (TDES_MR_CMTYP5_ADDACCESS_Val << TDES_MR_CMTYP5_Pos) /**< (TDES_MR) Countermeasure type 5 is enabled. Position  */
#define TDES_MR_CMTYP6_Pos                    _U_(29)                                              /**< (TDES_MR) Countermeasure Type 6 Position */
#define TDES_MR_CMTYP6_Msk                    (_U_(0x1) << TDES_MR_CMTYP6_Pos)                     /**< (TDES_MR) Countermeasure Type 6 Mask */
#define TDES_MR_CMTYP6(value)                 (TDES_MR_CMTYP6_Msk & ((value) << TDES_MR_CMTYP6_Pos))
#define   TDES_MR_CMTYP6_NO_UNIFORM_Val       _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 6 is disabled.  */
#define   TDES_MR_CMTYP6_UNIFORM_Val          _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 6 is enabled.  */
#define TDES_MR_CMTYP6_NO_UNIFORM             (TDES_MR_CMTYP6_NO_UNIFORM_Val << TDES_MR_CMTYP6_Pos) /**< (TDES_MR) Countermeasure type 6 is disabled. Position  */
#define TDES_MR_CMTYP6_UNIFORM                (TDES_MR_CMTYP6_UNIFORM_Val << TDES_MR_CMTYP6_Pos)   /**< (TDES_MR) Countermeasure type 6 is enabled. Position  */
#define TDES_MR_CMTYP7_Pos                    _U_(30)                                              /**< (TDES_MR) Countermeasure Type 7 Position */
#define TDES_MR_CMTYP7_Msk                    (_U_(0x1) << TDES_MR_CMTYP7_Pos)                     /**< (TDES_MR) Countermeasure Type 7 Mask */
#define TDES_MR_CMTYP7(value)                 (TDES_MR_CMTYP7_Msk & ((value) << TDES_MR_CMTYP7_Pos))
#define   TDES_MR_CMTYP7_NO_STARTDELAY_Val    _U_(0x0)                                             /**< (TDES_MR) Countermeasure type 7 is disabled.  */
#define   TDES_MR_CMTYP7_STARTDELAY_Val       _U_(0x1)                                             /**< (TDES_MR) Countermeasure type 7 is enabled.  */
#define TDES_MR_CMTYP7_NO_STARTDELAY          (TDES_MR_CMTYP7_NO_STARTDELAY_Val << TDES_MR_CMTYP7_Pos) /**< (TDES_MR) Countermeasure type 7 is disabled. Position  */
#define TDES_MR_CMTYP7_STARTDELAY             (TDES_MR_CMTYP7_STARTDELAY_Val << TDES_MR_CMTYP7_Pos) /**< (TDES_MR) Countermeasure type 7 is enabled. Position  */
#define TDES_MR_TAMPCLR_Pos                   _U_(31)                                              /**< (TDES_MR) Tamper Pin Clear Key Enable Position */
#define TDES_MR_TAMPCLR_Msk                   (_U_(0x1) << TDES_MR_TAMPCLR_Pos)                    /**< (TDES_MR) Tamper Pin Clear Key Enable Mask */
#define TDES_MR_TAMPCLR(value)                (TDES_MR_TAMPCLR_Msk & ((value) << TDES_MR_TAMPCLR_Pos))
#define TDES_MR_Msk                           _U_(0xFFF3B3D7)                                      /**< (TDES_MR) Register Mask  */

