Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/tdes.h
#define TDES_MR_CMTYP_Pos                     _U_(24)                                              /**< (TDES_MR Position) Countermeasure Type x */
#define TDES_MR_CMTYP_Msk                     (_U_(0x7F) << TDES_MR_CMTYP_Pos)                     /**< (TDES_MR Mask) CMTYP */
#define TDES_MR_CMTYP(value)                  (TDES_MR_CMTYP_Msk & ((value) << TDES_MR_CMTYP_Pos)) 

/* -------- TDES_IER : (TDES Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define TDES_IER_DATRDY_Pos                   _U_(0)                                               /**< (TDES_IER) Data Ready Interrupt Enable Position */
#define TDES_IER_DATRDY_Msk                   (_U_(0x1) << TDES_IER_DATRDY_Pos)                    /**< (TDES_IER) Data Ready Interrupt Enable Mask */
#define TDES_IER_DATRDY(value)                (TDES_IER_DATRDY_Msk & ((value) << TDES_IER_DATRDY_Pos))
#define TDES_IER_URAD_Pos                     _U_(8)                                               /**< (TDES_IER) Unspecified Register Access Detection Interrupt Enable Position */
#define TDES_IER_URAD_Msk                     (_U_(0x1) << TDES_IER_URAD_Pos)                      /**< (TDES_IER) Unspecified Register Access Detection Interrupt Enable Mask */
#define TDES_IER_URAD(value)                  (TDES_IER_URAD_Msk & ((value) << TDES_IER_URAD_Pos))
#define TDES_IER_SECE_Pos                     _U_(16)                                              /**< (TDES_IER) Security and/or Safety Event Interrupt Enable Position */
#define TDES_IER_SECE_Msk                     (_U_(0x1) << TDES_IER_SECE_Pos)                      /**< (TDES_IER) Security and/or Safety Event Interrupt Enable Mask */
#define TDES_IER_SECE(value)                  (TDES_IER_SECE_Msk & ((value) << TDES_IER_SECE_Pos))
#define TDES_IER_Msk                          _U_(0x00010101)                                      /**< (TDES_IER) Register Mask  */


/* -------- TDES_IDR : (TDES Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define TDES_IDR_DATRDY_Pos                   _U_(0)                                               /**< (TDES_IDR) Data Ready Interrupt Disable Position */
#define TDES_IDR_DATRDY_Msk                   (_U_(0x1) << TDES_IDR_DATRDY_Pos)                    /**< (TDES_IDR) Data Ready Interrupt Disable Mask */
#define TDES_IDR_DATRDY(value)                (TDES_IDR_DATRDY_Msk & ((value) << TDES_IDR_DATRDY_Pos))
#define TDES_IDR_URAD_Pos                     _U_(8)                                               /**< (TDES_IDR) Unspecified Register Access Detection Interrupt Disable Position */
#define TDES_IDR_URAD_Msk                     (_U_(0x1) << TDES_IDR_URAD_Pos)                      /**< (TDES_IDR) Unspecified Register Access Detection Interrupt Disable Mask */
#define TDES_IDR_URAD(value)                  (TDES_IDR_URAD_Msk & ((value) << TDES_IDR_URAD_Pos))
#define TDES_IDR_SECE_Pos                     _U_(16)                                              /**< (TDES_IDR) Security and/or Safety Event Interrupt Disable Position */
#define TDES_IDR_SECE_Msk                     (_U_(0x1) << TDES_IDR_SECE_Pos)                      /**< (TDES_IDR) Security and/or Safety Event Interrupt Disable Mask */
#define TDES_IDR_SECE(value)                  (TDES_IDR_SECE_Msk & ((value) << TDES_IDR_SECE_Pos))
#define TDES_IDR_Msk                          _U_(0x00010101)                                      /**< (TDES_IDR) Register Mask  */


/* -------- TDES_IMR : (TDES Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define TDES_IMR_DATRDY_Pos                   _U_(0)                                               /**< (TDES_IMR) Data Ready Interrupt Mask Position */
#define TDES_IMR_DATRDY_Msk                   (_U_(0x1) << TDES_IMR_DATRDY_Pos)                    /**< (TDES_IMR) Data Ready Interrupt Mask Mask */
#define TDES_IMR_DATRDY(value)                (TDES_IMR_DATRDY_Msk & ((value) << TDES_IMR_DATRDY_Pos))
#define TDES_IMR_URAD_Pos                     _U_(8)                                               /**< (TDES_IMR) Unspecified Register Access Detection Interrupt Mask Position */
#define TDES_IMR_URAD_Msk                     (_U_(0x1) << TDES_IMR_URAD_Pos)                      /**< (TDES_IMR) Unspecified Register Access Detection Interrupt Mask Mask */
#define TDES_IMR_URAD(value)                  (TDES_IMR_URAD_Msk & ((value) << TDES_IMR_URAD_Pos))
#define TDES_IMR_SECE_Pos                     _U_(16)                                              /**< (TDES_IMR) Security and/or Safety Event Interrupt Mask Position */
#define TDES_IMR_SECE_Msk                     (_U_(0x1) << TDES_IMR_SECE_Pos)                      /**< (TDES_IMR) Security and/or Safety Event Interrupt Mask Mask */
#define TDES_IMR_SECE(value)                  (TDES_IMR_SECE_Msk & ((value) << TDES_IMR_SECE_Pos))
#define TDES_IMR_Msk                          _U_(0x00010101)                                      /**< (TDES_IMR) Register Mask  */


/* -------- TDES_ISR : (TDES Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define TDES_ISR_DATRDY_Pos                   _U_(0)                                               /**< (TDES_ISR) Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx) Position */
#define TDES_ISR_DATRDY_Msk                   (_U_(0x1) << TDES_ISR_DATRDY_Pos)                    /**< (TDES_ISR) Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx) Mask */
#define TDES_ISR_DATRDY(value)                (TDES_ISR_DATRDY_Msk & ((value) << TDES_ISR_DATRDY_Pos))
#define TDES_ISR_URAD_Pos                     _U_(8)                                               /**< (TDES_ISR) Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST) Position */
#define TDES_ISR_URAD_Msk                     (_U_(0x1) << TDES_ISR_URAD_Pos)                      /**< (TDES_ISR) Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST) Mask */
#define TDES_ISR_URAD(value)                  (TDES_ISR_URAD_Msk & ((value) << TDES_ISR_URAD_Pos))
#define TDES_ISR_URAT_Pos                     _U_(12)                                              /**< (TDES_ISR) Unspecified Register Access (cleared by setting bit TDES_CR.SWRST) Position */
#define TDES_ISR_URAT_Msk                     (_U_(0x3) << TDES_ISR_URAT_Pos)                      /**< (TDES_ISR) Unspecified Register Access (cleared by setting bit TDES_CR.SWRST) Mask */
#define TDES_ISR_URAT(value)                  (TDES_ISR_URAT_Msk & ((value) << TDES_ISR_URAT_Pos))
#define   TDES_ISR_URAT_IDR_WR_PROCESSING_Val _U_(0x0)                                             /**< (TDES_ISR) Input Data Register written during data processing when SMOD = 0x2 mode.  */
#define   TDES_ISR_URAT_ODR_RD_PROCESSING_Val _U_(0x1)                                             /**< (TDES_ISR) Output Data Register read during data processing.  */
#define   TDES_ISR_URAT_MR_WR_PROCESSING_Val  _U_(0x2)                                             /**< (TDES_ISR) Mode Register written during data processing.  */
#define   TDES_ISR_URAT_WOR_RD_ACCESS_Val     _U_(0x3)                                             /**< (TDES_ISR) Write-only register read access.  */
#define TDES_ISR_URAT_IDR_WR_PROCESSING       (TDES_ISR_URAT_IDR_WR_PROCESSING_Val << TDES_ISR_URAT_Pos) /**< (TDES_ISR) Input Data Register written during data processing when SMOD = 0x2 mode. Position  */
#define TDES_ISR_URAT_ODR_RD_PROCESSING       (TDES_ISR_URAT_ODR_RD_PROCESSING_Val << TDES_ISR_URAT_Pos) /**< (TDES_ISR) Output Data Register read during data processing. Position  */
#define TDES_ISR_URAT_MR_WR_PROCESSING        (TDES_ISR_URAT_MR_WR_PROCESSING_Val << TDES_ISR_URAT_Pos) /**< (TDES_ISR) Mode Register written during data processing. Position  */
#define TDES_ISR_URAT_WOR_RD_ACCESS           (TDES_ISR_URAT_WOR_RD_ACCESS_Val << TDES_ISR_URAT_Pos) /**< (TDES_ISR) Write-only register read access. Position  */
#define TDES_ISR_SECE_Pos                     _U_(16)                                              /**< (TDES_ISR) Security and/or Safety Event Interrupt Mask Position */
#define TDES_ISR_SECE_Msk                     (_U_(0x1) << TDES_ISR_SECE_Pos)                      /**< (TDES_ISR) Security and/or Safety Event Interrupt Mask Mask */
#define TDES_ISR_SECE(value)                  (TDES_ISR_SECE_Msk & ((value) << TDES_ISR_SECE_Pos))
#define TDES_ISR_Msk                          _U_(0x00013101)                                      /**< (TDES_ISR) Register Mask  */


/* -------- TDES_KEY1WR : (TDES Offset: 0x20) ( /W 32) Key 1 Word Register -------- */
#define TDES_KEY1WR_KEY1W_Pos                 _U_(0)                                               /**< (TDES_KEY1WR) Key 1 Word Position */
#define TDES_KEY1WR_KEY1W_Msk                 (_U_(0xFFFFFFFF) << TDES_KEY1WR_KEY1W_Pos)           /**< (TDES_KEY1WR) Key 1 Word Mask */
#define TDES_KEY1WR_KEY1W(value)              (TDES_KEY1WR_KEY1W_Msk & ((value) << TDES_KEY1WR_KEY1W_Pos))
#define TDES_KEY1WR_Msk                       _U_(0xFFFFFFFF)                                      /**< (TDES_KEY1WR) Register Mask  */


