Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/tdes.h
/* -------- TDES_KEY2WR : (TDES Offset: 0x28) ( /W 32) Key 2 Word Register -------- */
#define TDES_KEY2WR_KEY2W_Pos                 _U_(0)                                               /**< (TDES_KEY2WR) Key 2 Word Position */
#define TDES_KEY2WR_KEY2W_Msk                 (_U_(0xFFFFFFFF) << TDES_KEY2WR_KEY2W_Pos)           /**< (TDES_KEY2WR) Key 2 Word Mask */
#define TDES_KEY2WR_KEY2W(value)              (TDES_KEY2WR_KEY2W_Msk & ((value) << TDES_KEY2WR_KEY2W_Pos))
#define TDES_KEY2WR_Msk                       _U_(0xFFFFFFFF)                                      /**< (TDES_KEY2WR) Register Mask  */


/* -------- TDES_KEY3WR : (TDES Offset: 0x30) ( /W 32) Key 3 Word Register -------- */
#define TDES_KEY3WR_KEY3W_Pos                 _U_(0)                                               /**< (TDES_KEY3WR) Key 3 Word Position */
#define TDES_KEY3WR_KEY3W_Msk                 (_U_(0xFFFFFFFF) << TDES_KEY3WR_KEY3W_Pos)           /**< (TDES_KEY3WR) Key 3 Word Mask */
#define TDES_KEY3WR_KEY3W(value)              (TDES_KEY3WR_KEY3W_Msk & ((value) << TDES_KEY3WR_KEY3W_Pos))
#define TDES_KEY3WR_Msk                       _U_(0xFFFFFFFF)                                      /**< (TDES_KEY3WR) Register Mask  */


/* -------- TDES_IDATAR : (TDES Offset: 0x40) ( /W 32) Input Data Register -------- */
#define TDES_IDATAR_IDATA_Pos                 _U_(0)                                               /**< (TDES_IDATAR) Input Data Position */
#define TDES_IDATAR_IDATA_Msk                 (_U_(0xFFFFFFFF) << TDES_IDATAR_IDATA_Pos)           /**< (TDES_IDATAR) Input Data Mask */
#define TDES_IDATAR_IDATA(value)              (TDES_IDATAR_IDATA_Msk & ((value) << TDES_IDATAR_IDATA_Pos))
#define TDES_IDATAR_Msk                       _U_(0xFFFFFFFF)                                      /**< (TDES_IDATAR) Register Mask  */


/* -------- TDES_ODATAR : (TDES Offset: 0x50) ( R/ 32) Output Data Register -------- */
#define TDES_ODATAR_ODATA_Pos                 _U_(0)                                               /**< (TDES_ODATAR) Output Data Position */
#define TDES_ODATAR_ODATA_Msk                 (_U_(0xFFFFFFFF) << TDES_ODATAR_ODATA_Pos)           /**< (TDES_ODATAR) Output Data Mask */
#define TDES_ODATAR_ODATA(value)              (TDES_ODATAR_ODATA_Msk & ((value) << TDES_ODATAR_ODATA_Pos))
#define TDES_ODATAR_Msk                       _U_(0xFFFFFFFF)                                      /**< (TDES_ODATAR) Register Mask  */


/* -------- TDES_IVR : (TDES Offset: 0x60) ( /W 32) Initialization Vector Register -------- */
#define TDES_IVR_IV_Pos                       _U_(0)                                               /**< (TDES_IVR) Initialization Vector Position */
#define TDES_IVR_IV_Msk                       (_U_(0xFFFFFFFF) << TDES_IVR_IV_Pos)                 /**< (TDES_IVR) Initialization Vector Mask */
#define TDES_IVR_IV(value)                    (TDES_IVR_IV_Msk & ((value) << TDES_IVR_IV_Pos))    
#define TDES_IVR_Msk                          _U_(0xFFFFFFFF)                                      /**< (TDES_IVR) Register Mask  */


/* -------- TDES_XTEA_RNDR : (TDES Offset: 0x70) (R/W 32) XTEA Rounds Register -------- */
#define TDES_XTEA_RNDR_XTEA_RNDS_Pos          _U_(0)                                               /**< (TDES_XTEA_RNDR) Number of Rounds Position */
#define TDES_XTEA_RNDR_XTEA_RNDS_Msk          (_U_(0x3F) << TDES_XTEA_RNDR_XTEA_RNDS_Pos)          /**< (TDES_XTEA_RNDR) Number of Rounds Mask */
#define TDES_XTEA_RNDR_XTEA_RNDS(value)       (TDES_XTEA_RNDR_XTEA_RNDS_Msk & ((value) << TDES_XTEA_RNDR_XTEA_RNDS_Pos))
#define TDES_XTEA_RNDR_Msk                    _U_(0x0000003F)                                      /**< (TDES_XTEA_RNDR) Register Mask  */


/* -------- TDES_WPMR : (TDES Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TDES_WPMR_WPEN_Pos                    _U_(0)                                               /**< (TDES_WPMR) Write Protection Enable Position */
#define TDES_WPMR_WPEN_Msk                    (_U_(0x1) << TDES_WPMR_WPEN_Pos)                     /**< (TDES_WPMR) Write Protection Enable Mask */
#define TDES_WPMR_WPEN(value)                 (TDES_WPMR_WPEN_Msk & ((value) << TDES_WPMR_WPEN_Pos))
#define TDES_WPMR_WPITEN_Pos                  _U_(1)                                               /**< (TDES_WPMR) Write Protection Interrupt Enable Position */
#define TDES_WPMR_WPITEN_Msk                  (_U_(0x1) << TDES_WPMR_WPITEN_Pos)                   /**< (TDES_WPMR) Write Protection Interrupt Enable Mask */
#define TDES_WPMR_WPITEN(value)               (TDES_WPMR_WPITEN_Msk & ((value) << TDES_WPMR_WPITEN_Pos))
#define TDES_WPMR_WPCREN_Pos                  _U_(2)                                               /**< (TDES_WPMR) Write Protection Control Enable Position */
#define TDES_WPMR_WPCREN_Msk                  (_U_(0x1) << TDES_WPMR_WPCREN_Pos)                   /**< (TDES_WPMR) Write Protection Control Enable Mask */
#define TDES_WPMR_WPCREN(value)               (TDES_WPMR_WPCREN_Msk & ((value) << TDES_WPMR_WPCREN_Pos))
#define TDES_WPMR_FIRSTE_Pos                  _U_(4)                                               /**< (TDES_WPMR) First Error Report Enable Position */
#define TDES_WPMR_FIRSTE_Msk                  (_U_(0x1) << TDES_WPMR_FIRSTE_Pos)                   /**< (TDES_WPMR) First Error Report Enable Mask */
#define TDES_WPMR_FIRSTE(value)               (TDES_WPMR_FIRSTE_Msk & ((value) << TDES_WPMR_FIRSTE_Pos))
#define TDES_WPMR_ACTION_Pos                  _U_(5)                                               /**< (TDES_WPMR) Action on Abnormal Event Detection Position */
#define TDES_WPMR_ACTION_Msk                  (_U_(0x7) << TDES_WPMR_ACTION_Pos)                   /**< (TDES_WPMR) Action on Abnormal Event Detection Mask */
#define TDES_WPMR_ACTION(value)               (TDES_WPMR_ACTION_Msk & ((value) << TDES_WPMR_ACTION_Pos))
#define   TDES_WPMR_ACTION_REPORT_ONLY_Val    _U_(0x0)                                             /**< (TDES_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags are set.  */
#define   TDES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val _U_(0x1)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.  */
#define   TDES_WPMR_ACTION_LOCK_CGD_SEQE_Val  _U_(0x2)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.  */
#define   TDES_WPMR_ACTION_LOCK_ANY_EV_Val    _U_(0x3)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.  */
#define   TDES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val _U_(0x4)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared.  */
#define   TDES_WPMR_ACTION_CLEAR_CGD_SEQE_Val _U_(0x5)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared.  */
#define   TDES_WPMR_ACTION_CLEAR_ANY_EV_Val   _U_(0x6)                                             /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared.  */
#define TDES_WPMR_ACTION_REPORT_ONLY          (TDES_WPMR_ACTION_REPORT_ONLY_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags are set. Position  */
#define TDES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE (TDES_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued. Position  */
#define TDES_WPMR_ACTION_LOCK_CGD_SEQE        (TDES_WPMR_ACTION_LOCK_CGD_SEQE_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued. Position  */
#define TDES_WPMR_ACTION_LOCK_ANY_EV          (TDES_WPMR_ACTION_LOCK_ANY_EV_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued. Position  */
#define TDES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE (TDES_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared. Position  */
#define TDES_WPMR_ACTION_CLEAR_CGD_SEQE       (TDES_WPMR_ACTION_CLEAR_CGD_SEQE_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared. Position  */
#define TDES_WPMR_ACTION_CLEAR_ANY_EV         (TDES_WPMR_ACTION_CLEAR_ANY_EV_Val << TDES_WPMR_ACTION_Pos) /**< (TDES_WPMR) If a processing is in progress when the TDES_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a TDES_CR.UNLOCK command is issued.Moreover, the TDES_KEYxWRx Key Word Registers are immediately cleared. Position  */
#define TDES_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (TDES_WPMR) Write Protection Key Position */
#define TDES_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << TDES_WPMR_WPKEY_Pos)               /**< (TDES_WPMR) Write Protection Key Mask */
#define TDES_WPMR_WPKEY(value)                (TDES_WPMR_WPKEY_Msk & ((value) << TDES_WPMR_WPKEY_Pos))
#define   TDES_WPMR_WPKEY_PASSWD_Val          _U_(0x444553)                                        /**< (TDES_WPMR) Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN.Always reads as 0.  */
#define TDES_WPMR_WPKEY_PASSWD                (TDES_WPMR_WPKEY_PASSWD_Val << TDES_WPMR_WPKEY_Pos)  /**< (TDES_WPMR) Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN.Always reads as 0. Position  */
#define TDES_WPMR_Msk                         _U_(0xFFFFFFF7)                                      /**< (TDES_WPMR) Register Mask  */


/* -------- TDES_WPSR : (TDES Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define TDES_WPSR_WPVS_Pos                    _U_(0)                                               /**< (TDES_WPSR) Write Protection Violation Status (cleared on read) Position */
#define TDES_WPSR_WPVS_Msk                    (_U_(0x1) << TDES_WPSR_WPVS_Pos)                     /**< (TDES_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define TDES_WPSR_WPVS(value)                 (TDES_WPSR_WPVS_Msk & ((value) << TDES_WPSR_WPVS_Pos))
#define TDES_WPSR_CGD_Pos                     _U_(1)                                               /**< (TDES_WPSR) Clock Glitch Detected (cleared on read) Position */
#define TDES_WPSR_CGD_Msk                     (_U_(0x1) << TDES_WPSR_CGD_Pos)                      /**< (TDES_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define TDES_WPSR_CGD(value)                  (TDES_WPSR_CGD_Msk & ((value) << TDES_WPSR_CGD_Pos))
#define TDES_WPSR_SEQE_Pos                    _U_(2)                                               /**< (TDES_WPSR) Internal Sequencer Error (cleared on read) Position */
#define TDES_WPSR_SEQE_Msk                    (_U_(0x1) << TDES_WPSR_SEQE_Pos)                     /**< (TDES_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define TDES_WPSR_SEQE(value)                 (TDES_WPSR_SEQE_Msk & ((value) << TDES_WPSR_SEQE_Pos))
#define TDES_WPSR_SWE_Pos                     _U_(3)                                               /**< (TDES_WPSR) Software Control Error (cleared on read) Position */
#define TDES_WPSR_SWE_Msk                     (_U_(0x1) << TDES_WPSR_SWE_Pos)                      /**< (TDES_WPSR) Software Control Error (cleared on read) Mask */
#define TDES_WPSR_SWE(value)                  (TDES_WPSR_SWE_Msk & ((value) << TDES_WPSR_SWE_Pos))
#define TDES_WPSR_PKRPVS_Pos                  _U_(4)                                               /**< (TDES_WPSR) Private Key Register Protection Violation Status (cleared on read) Position */
#define TDES_WPSR_PKRPVS_Msk                  (_U_(0x1) << TDES_WPSR_PKRPVS_Pos)                   /**< (TDES_WPSR) Private Key Register Protection Violation Status (cleared on read) Mask */
#define TDES_WPSR_PKRPVS(value)               (TDES_WPSR_PKRPVS_Msk & ((value) << TDES_WPSR_PKRPVS_Pos))
#define TDES_WPSR_WPVSRC_Pos                  _U_(8)                                               /**< (TDES_WPSR) Write Protection Violation Source (cleared on read) Position */
#define TDES_WPSR_WPVSRC_Msk                  (_U_(0xFFFF) << TDES_WPSR_WPVSRC_Pos)                /**< (TDES_WPSR) Write Protection Violation Source (cleared on read) Mask */
#define TDES_WPSR_WPVSRC(value)               (TDES_WPSR_WPVSRC_Msk & ((value) << TDES_WPSR_WPVSRC_Pos))
#define TDES_WPSR_SWETYP_Pos                  _U_(24)                                              /**< (TDES_WPSR) Software Error Type (cleared on read) Position */
#define TDES_WPSR_SWETYP_Msk                  (_U_(0xF) << TDES_WPSR_SWETYP_Pos)                   /**< (TDES_WPSR) Software Error Type (cleared on read) Mask */
#define TDES_WPSR_SWETYP(value)               (TDES_WPSR_SWETYP_Msk & ((value) << TDES_WPSR_SWETYP_Pos))
#define   TDES_WPSR_SWETYP_READ_WO_Val        _U_(0x0)                                             /**< (TDES_WPSR) A write-only register has been read (Warning).  */
#define   TDES_WPSR_SWETYP_WRITE_RO_Val       _U_(0x1)                                             /**< (TDES_WPSR) TDES is enabled and a write access has been performed on a read-only register (Warning).  */
#define   TDES_WPSR_SWETYP_UNDEF_RW_Val       _U_(0x2)                                             /**< (TDES_WPSR) Access to an undefined address (Warning).  */
#define   TDES_WPSR_SWETYP_CTRL_START_Val     _U_(0x3)                                             /**< (TDES_WPSR) Abnormal use of TDES_CR.START command when DMA access is configured.  */
#define   TDES_WPSR_SWETYP_WEIRD_ACTION_Val   _U_(0x4)                                             /**< (TDES_WPSR) A key write, init value write, output data read, Mode register write, Private Key Bus access or XTEA round register has been performed while a current processing is in progress (abnormal).  */
#define   TDES_WPSR_SWETYP_INCOMPLETE_KEY_Val _U_(0x5)                                             /**< (TDES_WPSR) A tentative of start is required while the keys are not fully loaded into the TDES_KEYxWRx registers.  */
#define TDES_WPSR_SWETYP_READ_WO              (TDES_WPSR_SWETYP_READ_WO_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) A write-only register has been read (Warning). Position  */
#define TDES_WPSR_SWETYP_WRITE_RO             (TDES_WPSR_SWETYP_WRITE_RO_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) TDES is enabled and a write access has been performed on a read-only register (Warning). Position  */
#define TDES_WPSR_SWETYP_UNDEF_RW             (TDES_WPSR_SWETYP_UNDEF_RW_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) Access to an undefined address (Warning). Position  */
#define TDES_WPSR_SWETYP_CTRL_START           (TDES_WPSR_SWETYP_CTRL_START_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) Abnormal use of TDES_CR.START command when DMA access is configured. Position  */
#define TDES_WPSR_SWETYP_WEIRD_ACTION         (TDES_WPSR_SWETYP_WEIRD_ACTION_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) A key write, init value write, output data read, Mode register write, Private Key Bus access or XTEA round register has been performed while a current processing is in progress (abnormal). Position  */
#define TDES_WPSR_SWETYP_INCOMPLETE_KEY       (TDES_WPSR_SWETYP_INCOMPLETE_KEY_Val << TDES_WPSR_SWETYP_Pos) /**< (TDES_WPSR) A tentative of start is required while the keys are not fully loaded into the TDES_KEYxWRx registers. Position  */
#define TDES_WPSR_ECLASS_Pos                  _U_(31)                                              /**< (TDES_WPSR) Software Error Class (cleared on read) Position */
#define TDES_WPSR_ECLASS_Msk                  (_U_(0x1) << TDES_WPSR_ECLASS_Pos)                   /**< (TDES_WPSR) Software Error Class (cleared on read) Mask */
#define TDES_WPSR_ECLASS(value)               (TDES_WPSR_ECLASS_Msk & ((value) << TDES_WPSR_ECLASS_Pos))
#define   TDES_WPSR_ECLASS_WARNING_Val        _U_(0x0)                                             /**< (TDES_WPSR) An abnormal access that does not affect system functionality.  */
#define   TDES_WPSR_ECLASS_ERROR_Val          _U_(0x1)                                             /**< (TDES_WPSR)   */
#define TDES_WPSR_ECLASS_WARNING              (TDES_WPSR_ECLASS_WARNING_Val << TDES_WPSR_ECLASS_Pos) /**< (TDES_WPSR) An abnormal access that does not affect system functionality. Position  */
#define TDES_WPSR_ECLASS_ERROR                (TDES_WPSR_ECLASS_ERROR_Val << TDES_WPSR_ECLASS_Pos) /**< (TDES_WPSR)  Position  */
#define TDES_WPSR_Msk                         _U_(0x8FFFFF1F)                                      /**< (TDES_WPSR) Register Mask  */


/* -------- TDES_VERSION : (TDES Offset: 0xFC) ( R/ 32) Version Register -------- */
#define TDES_VERSION_VERSION_Pos              _U_(0)                                               /**< (TDES_VERSION) Version of the Hardware Module Position */
#define TDES_VERSION_VERSION_Msk              (_U_(0xFFF) << TDES_VERSION_VERSION_Pos)             /**< (TDES_VERSION) Version of the Hardware Module Mask */
#define TDES_VERSION_VERSION(value)           (TDES_VERSION_VERSION_Msk & ((value) << TDES_VERSION_VERSION_Pos))
#define TDES_VERSION_MFN_Pos                  _U_(16)                                              /**< (TDES_VERSION) Metal Fix Number Position */
#define TDES_VERSION_MFN_Msk                  (_U_(0x7) << TDES_VERSION_MFN_Pos)                   /**< (TDES_VERSION) Metal Fix Number Mask */
#define TDES_VERSION_MFN(value)               (TDES_VERSION_MFN_Msk & ((value) << TDES_VERSION_MFN_Pos))
#define TDES_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (TDES_VERSION) Register Mask  */


/** \brief TDES register offsets definitions */
#define TDES_CR_REG_OFST               (0x00)              /**< (TDES_CR) Control Register Offset */
#define TDES_MR_REG_OFST               (0x04)              /**< (TDES_MR) Mode Register Offset */
#define TDES_IER_REG_OFST              (0x10)              /**< (TDES_IER) Interrupt Enable Register Offset */
#define TDES_IDR_REG_OFST              (0x14)              /**< (TDES_IDR) Interrupt Disable Register Offset */
#define TDES_IMR_REG_OFST              (0x18)              /**< (TDES_IMR) Interrupt Mask Register Offset */
#define TDES_ISR_REG_OFST              (0x1C)              /**< (TDES_ISR) Interrupt Status Register Offset */
#define TDES_KEY1WR_REG_OFST           (0x20)              /**< (TDES_KEY1WR) Key 1 Word Register Offset */
#define TDES_KEY2WR_REG_OFST           (0x28)              /**< (TDES_KEY2WR) Key 2 Word Register Offset */
#define TDES_KEY3WR_REG_OFST           (0x30)              /**< (TDES_KEY3WR) Key 3 Word Register Offset */
#define TDES_IDATAR_REG_OFST           (0x40)              /**< (TDES_IDATAR) Input Data Register Offset */
#define TDES_ODATAR_REG_OFST           (0x50)              /**< (TDES_ODATAR) Output Data Register Offset */
#define TDES_IVR_REG_OFST              (0x60)              /**< (TDES_IVR) Initialization Vector Register Offset */
#define TDES_XTEA_RNDR_REG_OFST        (0x70)              /**< (TDES_XTEA_RNDR) XTEA Rounds Register Offset */
#define TDES_WPMR_REG_OFST             (0xE4)              /**< (TDES_WPMR) Write Protection Mode Register Offset */
#define TDES_WPSR_REG_OFST             (0xE8)              /**< (TDES_WPSR) Write Protection Status Register Offset */
#define TDES_VERSION_REG_OFST          (0xFC)              /**< (TDES_VERSION) Version Register Offset */

